# Шаг 1: Используем официальный образ Eclipse Temurin с Java 21 на базе Alpine (очень легкий)
FROM eclipse-temurin:21-jre-alpine

# Шаг 2: Создаем рабочую директорию внутри контейнера
WORKDIR /app

# Шаг 3: Копируем скомпилированный jar-файл из папки target в контейнер
# Имя jar-файла должно совпадать с тем, что собирает ваш Maven (артефакт-version.jar)
COPY target/securityProject-1.0.0.jar app.jar

# Шаг 4: Указываем порт, который слушает приложение (мы настроили 8082)
EXPOSE 8082

# Шаг 5: Команда для запуска приложения при старте контейнера
ENTRYPOINT ["java", "-jar", "app.jar"]